{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "FQuickBakerCore",
			"Children": [
				{
					"Source":
					{
						"Text": "Bake Texture"
					},
					"Translation":
					{
						"Text": "テクスチャをベイク"
					},
					"Key": "BakeTextureTransaction"
				},
				{
					"Source":
					{
						"Text": "Baking Texture..."
					},
					"Translation":
					{
						"Text": "テクスチャをベイク中..."
					},
					"Key": "BakingTexture"
				},
				{
					"Source":
					{
						"Text": "Failed to create output directory."
					},
					"Translation":
					{
						"Text": "出力ディレクトリの作成に失敗しました。"
					},
					"Key": "Error_MakeDirectory"
				},
				{
					"Source":
					{
						"Text": "Failed to create render target."
					},
					"Translation":
					{
						"Text": "レンダーターゲットの作成に失敗しました。"
					},
					"Key": "Error_RTCreate"
				},
				{
					"Source":
					{
						"Text": "Failed to create texture from render target."
					},
					"Translation":
					{
						"Text": "レンダーターゲットからのテクスチャ作成に失敗しました。"
					},
					"Key": "Error_BakeFailed"
				},
				{
					"Source":
					{
						"Text": "Failed to save file to disk or convert image."
					},
					"Translation":
					{
						"Text": "ディスクへのファイル保存または画像変換に失敗しました。"
					},
					"Key": "Error_SaveFile"
				},
				{
					"Source":
					{
						"Text": "No valid editor world found."
					},
					"Translation":
					{
						"Text": "有効なエディタワールドが見つかりません。"
					},
					"Key": "Error_NoWorld"
				},
				{
					"Source":
					{
						"Text": "Rendering Material..."
					},
					"Translation":
					{
						"Text": "マテリアルをレンダリング中..."
					},
					"Key": "Rendering"
				},
				{
					"Source":
					{
						"Text": "Saved to {0}"
					},
					"Translation":
					{
						"Text": "{0} に保存しました"
					},
					"Key": "Success_Export"
				},
				{
					"Source":
					{
						"Text": "Saving..."
					},
					"Translation":
					{
						"Text": "保存中..."
					},
					"Key": "Saving"
				},
				{
					"Source":
					{
						"Text": "Setting up Render Target..."
					},
					"Translation":
					{
						"Text": "レンダーターゲットをセットアップ中..."
					},
					"Key": "SetupRT"
				},
				{
					"Source":
					{
						"Text": "Texture baked successfully!"
					},
					"Translation":
					{
						"Text": "テクスチャのベイクに成功しました！"
					},
					"Key": "Success_Bake"
				}
			]
		},
		{
			"Namespace": "FQuickBakerModule",
			"Children": [
				{
					"Source":
					{
						"Text": "Open Quick Baker with this material"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "QuickBakerContextTooltip"
				},
				{
					"Source":
					{
						"Text": "Opens the Quick Baker window"
					},
					"Translation":
					{
						"Text": "Quick Bakerウィンドウを開きます"
					},
					"Key": "QuickBakerTooltip"
				},
				{
					"Source":
					{
						"Text": "Quick Baker"
					},
					"Translation":
					{
						"Text": "Quick Baker"
					},
					"Key": "QuickBakerContextCommand"
				},
				{
					"Source":
					{
						"Text": "Quick Baker"
					},
					"Translation":
					{
						"Text": "Quick Baker"
					},
					"Key": "QuickBakerCommand"
				},
				{
					"Source":
					{
						"Text": "QuickBaker"
					},
					"Translation":
					{
						"Text": "QuickBaker"
					},
					"Key": "QuickBakerLabel"
				},
				{
					"Source":
					{
						"Text": "QuickBaker"
					},
					"Translation":
					{
						"Text": "QuickBaker"
					},
					"Key": "QuickBakerTabTitle"
				},
				{
					"Source":
					{
						"Text": "QuickBaker"
					},
					"Translation":
					{
						"Text": "QuickBaker"
					},
					"Key": "QuickBakerContextLabel"
				}
			]
		},
		{
			"Namespace": "SQuickBakerWidget",
			"Children": [
				{
					"Source":
					{
						"Text": "Bake Texture"
					},
					"Translation":
					{
						"Text": "テクスチャをベイク"
					},
					"Key": "BakeTexture"
				},
				{
					"Source":
					{
						"Text": "Bit Depth"
					},
					"Translation":
					{
						"Text": "ビット深度"
					},
					"Key": "Label_BitDepth"
				},
				{
					"Source":
					{
						"Text": "Browse"
					},
					"Translation":
					{
						"Text": "参照"
					},
					"Key": "Browse"
				},
				{
					"Source":
					{
						"Text": "Choose between 8-bit and 16-bit. 16-bit is highly recommended for Noise and SDF to avoid banding."
					},
					"Translation":
					{
						"Text": "8bitと16bitのいずれかを選択します。バンディングを防ぐため、ノイズやSDFには16bitを強く推奨します。"
					},
					"Key": "Tooltip_BitDepth"
				},
				{
					"Source":
					{
						"Text": "Compression"
					},
					"Translation":
					{
						"Text": "圧縮"
					},
					"Key": "Label_Compression"
				},
				{
					"Source":
					{
						"Text": "Invalid bake settings."
					},
					"Translation":
					{
						"Text": "ベイク設定が無効です。"
					},
					"Key": "Error_InvalidSettings"
				},
				{
					"Source":
					{
						"Text": "Material"
					},
					"Translation":
					{
						"Text": "マテリアル"
					},
					"Key": "Label_Material"
				},
				{
					"Source":
					{
						"Text": "Open the Asset Picker or Folder Dialog to select a destination folder."
					},
					"Translation":
					{
						"Text": "アセットピッカーまたはフォルダダイアログを開き、保存先フォルダを選択します。"
					},
					"Key": "Tooltip_Browse"
				},
				{
					"Source":
					{
						"Text": "Output Name"
					},
					"Translation":
					{
						"Text": "出力名"
					},
					"Key": "Label_OutputName"
				},
				{
					"Source":
					{
						"Text": "Output Path"
					},
					"Translation":
					{
						"Text": "出力パス"
					},
					"Key": "Label_OutputPath"
				},
				{
					"Source":
					{
						"Text": "Output Type"
					},
					"Translation":
					{
						"Text": "出力タイプ"
					},
					"Key": "Label_OutputType"
				},
				{
					"Source":
					{
						"Text": "Please select a material to bake."
					},
					"Translation":
					{
						"Text": "ベイクするマテリアルを選択してください。"
					},
					"Key": "Error_NoMaterial"
				},
				{
					"Source":
					{
						"Text": "Please specify an output name."
					},
					"Translation":
					{
						"Text": "出力名を指定してください。"
					},
					"Key": "Error_NoName"
				},
				{
					"Source":
					{
						"Text": "Resolution"
					},
					"Translation":
					{
						"Text": "解像度"
					},
					"Key": "Label_Resolution"
				},
				{
					"Source":
					{
						"Text": "Save Texture"
					},
					"Translation":
					{
						"Text": "テクスチャを保存"
					},
					"Key": "SaveTextureDialog"
				},
				{
					"Source":
					{
						"Text": "Select Output Folder"
					},
					"Translation":
					{
						"Text": "出力フォルダを選択"
					},
					"Key": "SelectFolder"
				},
				{
					"Source":
					{
						"Text": "Select the Material or Material Instance to bake. The 'Final Color' (Emissive) will be captured."
					},
					"Translation":
					{
						"Text": "ベイクするマテリアルまたはマテリアルインスタンスを選択します。「ファイナルカラー」（エミッシブ）がキャプチャされます。"
					},
					"Key": "Tooltip_Material"
				},
				{
					"Source":
					{
						"Text": "Select the compression format for the resulting texture. TC_Default is standard for most cases."
					},
					"Translation":
					{
						"Text": "結果のテクスチャの圧縮形式を選択します。ほとんどの場合、TC_Defaultが標準的です。"
					},
					"Key": "Tooltip_Compression"
				},
				{
					"Source":
					{
						"Text": "Select the output format: Asset, PNG, or EXR."
					},
					"Translation":
					{
						"Text": "出力形式を選択します: アセット、PNG、またはEXR。"
					},
					"Key": "Tooltip_OutputType"
				},
				{
					"Source":
					{
						"Text": "Set the width and height of the output texture. Higher values provide more detail but use more memory."
					},
					"Translation":
					{
						"Text": "出力テクスチャの幅と高さを設定します。値が高いほど詳細になりますが、メモリを多く使用します。"
					},
					"Key": "Tooltip_Resolution"
				},
				{
					"Source":
					{
						"Text": "Start the baking process. This will render the material to a temporary Render Target and save it as a Static Texture or File."
					},
					"Translation":
					{
						"Text": "ベイク処理を開始します。マテリアルを一時的なレンダーターゲットにレンダリングし、静的テクスチャまたはファイルとして保存します。"
					},
					"Key": "Tooltip_Bake"
				},
				{
					"Source":
					{
						"Text": "The destination folder in the Content Browser or on disk."
					},
					"Translation":
					{
						"Text": "コンテンツブラウザまたはディスク上の保存先フォルダです。"
					},
					"Key": "Tooltip_OutputPath"
				},
				{
					"Source":
					{
						"Text": "The name of the generated Texture asset. Automatically prefixed with T_ based on naming conventions."
					},
					"Translation":
					{
						"Text": "生成されるテクスチャアセットの名前です。命名規則に基づいて自動的にT_という接頭辞が付きます。"
					},
					"Key": "Tooltip_OutputName"
				},
				{
					"Source":
					{
						"Text": "Tip: Use Unlit materials or ensure Emissive (Final Color) is connected."
					},
					"Translation":
					{
						"Text": "ヒント: Unlitマテリアルを使用するか、エミッシブ（ファイナルカラー）が接続されていることを確認してください。"
					},
					"Key": "MaterialHint"
				},
				{
					"Source":
					{
						"Text": "⚠️ This material is not Unlit. Ensure Emissive (Final Color) is connected."
					},
					"Translation":
					{
						"Text": "⚠️ このマテリアルはUnlitではありません。エミッシブ（ファイナルカラー）が接続されていることを確認してください。"
					},
					"Key": "MaterialWarning"
				}
			]
		}
	]
}